{
  "conversations": [
    [
      "Hi!",
      "Hello, how can I help?",
      "How should patients with fever and cough take cold medicine?",
      "Patients with diabetes should take cold medicine carefully: Avoid syrups with high sugar content—choose sugar-free or tablet forms. Check labels for decongestants (like pseudoephedrine), which may raise blood sugar or blood pressure. Monitor blood glucose more often during illness. Stay hydrated and eat small, balanced meals. Consult a doctor or pharmacist before taking any new medication. Fever and cough can raise blood sugar—adjust treatment as advised."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should I eat if I have diabetes and stomach problems at the same time?",
      "If you have diabetes and stomach problems (e.g., nausea, bloating, diarrhea), eat: Easily digestible foods: plain rice, toast, boiled potatoes, banana. Low-fat, low-fiber meals to ease digestion. Small, frequent meals instead of large ones. Plenty of fluids: water, clear broth, unsweetened herbal tea. Avoid spicy, greasy, or sugary foods. Monitor blood sugar closely, and consult your doctor—especially if symptoms persist."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does Vietnam have a national diabetes screening program?",
      "Yes, Vietnam has a national diabetes screening program that offers: Annual blood sugar tests for adults aged 40+, Community screenings via local clinics and health campaigns. It helps with early detection and timely treatment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can Eastern medicine be combined with Western medicine in treatment?",
      "Yes, Eastern medicine (e.g., herbal remedies, acupuncture) can be combined with Western medicine in diabetes care, but: It must be done under doctor supervision, Some herbs may interact with medications or affect blood sugar, Evidence varies—some therapies lack strong clinical proof. Always inform your doctor about any traditional treatments you use. Safe integration can support overall care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Which specialist should patients see?",
      "Patients with diabetes should see an endocrinologist, a doctor who specializes in hormone-related conditions, including diabetes. They may also need to see: A primary care physician for general management, A dietitian for nutrition planning, An ophthalmologist for eye exams. A podiatrist for foot care. Team-based care ensures better control and complication prevention."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes travel?",
      "Yes, people with diabetes can travel safely with proper planning: Carry medications, insulin, glucose meter, snacks, Keep time zones in mind for insulin doses, Stay hydrated and eat on schedule, Wear medical ID, Check blood sugar regularly. Consult your doctor before long trips or flying."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How often should they be re-examined?",
      "People with diabetes should be re-examined: Every 3–6 months for blood sugar (HbA1c). Annually for eyes, kidneys, cholesterol, and feet. More frequently if blood sugar is poorly controlled or complications arise. Follow your doctor’s schedule for personalized care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can diabetics drink fruit juice?",
      "Occasionally, in small amounts, but it's not recommended. Fruit juice spikes blood sugar quickly. Whole fruits with fiber are a better choice. If used, choose 100% unsweetened juice and limit to ½ cup."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should we establish a personal diabetes management profile?",
      "Yes. A personal diabetes management profile helps by: Tracking blood sugar, meds, meals, and exercise, Identifying patterns and risk factors, Supporting personalized treatment adjustments, Improving long-term control and outcomes. It’s a key tool for self-care and doctor support."
    ],
    [
      "Hey, how are you?",
      "Hi! I'm feeling great today.",
      "What did you do today?",
      "I played a baskeball match this morning.",
      "How was it? Did you win?",
      "Yes!! And I scored 40 points.",
      "Wow! You did an amazing match! Did the sport afect your glucose?",
      "Yes, my sugar level was low after lunch.",
      "Did you inject too much insulin?",
      "Yes, I didn't take into account the exercise.",
      "Next time, think about the exercise when you calculate the insulin dose.",
      "Yes I will.",
      "Bye.",
      "Goodbye.",
      "Hello!",
      "Hi, how is it going?",
      "Great, I had a very good blood glucose level today.",
      "That's nice, keep it up! Having a good glucose level is great.",
      "Thank you! But it may rise this afternoon.",
      "Why is that?",
      "Because I just ate a big sandwich now.",
      "And did you put your insulin?",
      "Yes, but maybe it was not enough.",
      "Then you should check your glucose in an hour and a half and correct the dose if necessary.",
      "Thanks for your advice.",
      "No problem, see you later.",
      "Till later.",
      "Hi, I need your help.",
      "What's the matter?",
      "I forgot to put my insulin after lunch and now I have a high sugar level.",
      "Don't worry, you can put your insulin now and it will reduce.",
      "How much insulin should I put?",
      "Calculate your insulin dose taking into account when did you eat and your actual sugar level.",
      "Ok, I will do that.",
      "You should also consider if you did some exercise today.",
      "No, I was home all day.",
      "Maybe you should do some exercise, it will also help to reduce your blood sugar level.",
      "Perfect, I will go to do some running now. See you.",
      "Have a nice day, bye.",
      "Bye bye.",
      "Hi, what are you going to do today?",
      "I'm going to the mountain.",
      "Be careful if you are going to walk a lot, you may need to decrease your insulin dose.",
      "Yes, I will decrease my insulin dose and I will also eat some cookies before leaving.",
      "Well done, but it is possible that you need to check your glucose level during the day.",
      "Ok, but what should I do if my blood glucose level is low?",
      "You should always have sugar in your bag in case your blood glucose drops.",
      "Does it have to be sugar?",
      "No, you could also drink a juice with enough amount of carbohidrates.",
      "Great, that is all I need to know.",
      "Enjoy your day on the mountain.",
      "I will, bye!",
      "See you later.",
      "Hello, how are you?",
      "I am feeling stressed lately.",
      "What is making you feel that way?",
      "I have a very important exam today and I cannot fail.",
      "Have you studied for the exam?",
      "I was studying all this week for my exam and I think this affected my blood glucose.",
      "Why do you say that?",
      "I couldn't control my blood sugar level very good this week, it was always high.",
      "Did you change yor diet or insulin dose?",
      "No, I kept them the same as usual.",
      "The stress from the exam is probably causing this rise in your glucose level.",
      "Will it improve after I finish my exam?",
      "The glucose level will surely improve after you finish.",
      "I hope so.",
      "See you, bye.",
      "See you.",
      "How are you feeling today?",
      "Hey, I am not feeling right.",
      "How come?",
      "I think I got a virus and I have stomachache.",
      "Did this affect your glucose levels?",
      "Yes, I think so. My glucose is abnormally high since my stomach started hurting.",
      "This is normal, you should rise your insulin doses until you get better.",
      "All right, I hope this helps me to have a better glucose control.",
      "Anyways, it should improve after you heal from the stomachache.",
      "I hope I heal soon.",
      "I hope so too. Bye.",
      "bye.",
      "Hey, what did you do yesterday?",
      "I spent the whole day chilling and I went to a fancy restaurant for dinner.",
      "Nice! What did you order?",
      "I had a big steak with french fries and a cheesecake for dessert.",
      "Sounds delicious. Did you have to inject a big dose of insulin?",
      "Yes, I injected 15 units of fast action insulin.",
      "I see, the fries and the cheesecake have a lot of carbohidrates.",
      "I had a good level of blood glucose two hours after dinner, but this morning I woke up quite high.",
      "What was your blood glucose level this morning?",
      "245, a bit higher than I would like.",
      "It's difficult to maintain always a good blood glucose level. Are you gonna do something to improve it?",
      "I'm going for a walk in the park now.",
      "Great, enjoy your walk.",
      "You enjoy your day too, bye.",
      "Hi!!!",
      "What's up?",
      "I am very excited! I have a date this afternoon.",
      "What are you gonna do?",
      "We are going to do ice skating.",
      "That sounds great!",
      "Yes, and after skating we will get some pizzas.",
      "Hmmm I love pizza, but remember pizza has a high amount of carbohidrates.",
      "I know, but it shouldn't affect my sugar level that much because I will skate this afternoon.",
      "Don't forget to measure your blood sugar level one hour and a half after dinner.",
      "I will, just in case I have to correct my insulin dose or eat more carbohidrates.",
      "Enjoy your date.",
      "Thanks! I will tell you how it ends.",
      "Goodbye!",
      "See you soon.",
      "Good morning!",
      "Hey, it's nice to see you here again. How are you?",
      "I woke up low today.",
      "Oh, that's sad. Did you eat some sugar to recover?",
      "No, I had an orange juice and now I am feeling fine.",
      "That's great. Do you know why this happened?",
      "I think I calculated my dinner insulin dose incorrectly.",
      "You can also try to calculate more precisely the carbohidrate amount in your dinner.",
      "Yes, I will try to eat more next time. I have to go, I'll talk to you later.",
      "Have a nice day, goodbye.",
      "See you.",
      "Hey, I have amazing news to tell you.",
      "You seem very excited. What's the matter?",
      "I am going to get married next Sunday!!!",
      "Congratulations! Are you ready for the day?",
      "Yes, but I feel very nervous because I still have things to prepare for the wedding.",
      "I think the wedding is gonna be great, so you shouldn't overthink it.",
      "Yes, but it is inevitable. I think it is also affecting my glucose levels.",
      "Have you noticed a rise in your glucose levels lately?",
      "Exactly.",
      "Then let's hope everything works out great.",
      "Thank you very much! See you.",
      "Talk to you later, bye.",
      "Good night.",
      "Hi.",
      "What are you doing?",
      "Not much, I am lying in the sofa watching a movie with some popcorn.",
      "That sounds like a great plan to me.",
      "Well, I wanted to go out with friends for dinner because I stayed the whole day at home.",
      "Let me guess. Your friends were not free today?",
      "You got it right.",
      "And how was your glucose today? A lack of exercise tends to increase the glucose levels.",
      "Yes, they were a bit high, but I really wanted to have some popcorn.",
      "You should increase your insulin dose if you want to have a good glucose level.",
      "I am going to put insulin right now, thanks for the advice.",
      "No problem, I hope you enjoy the movie.",
      "Thanks, talk to you tomorrow.",
      "Have a good night!",
      "Hey, how are you doing?",
      "Fine, but I could be doing better.",
      "How come? Did something happen?",
      "Every morning I wake up with my sugar a bit high, even if I went to bed with a good sugar level.",
      "It could be related to the carbohidrate amount in your dinner.",
      "No, I don't think so. I eat different food and inject my insulin dose accordingly, but after four or five hours my sugar increases.",
      "Did you change your insulin type or your lifestyle?",
      "I had a leg injury and I've stopped doing sport, and in the past I used to do a lot.",
      "That could be the cause behind your rise in glucose.",
      "Yes, I suppose so. Should I increase my insulin dose?",
      "You probably should increase the dose, but speak with your doctor first.",
      "Thanks, I will contact my doctor to solve this problem.",
      "Great, have a nice day.",
      "You too, bye!",
      "Hi, are you awake?",
      "Yes, I am. What's the matter?",
      "I just woke up in the middle of the night and I cannot sleep again.",
      "Did you check your glucose level?",
      "I didn't think about that, I will check it right now.",
      "Okay, I will wait here.",
      "My blood glucose level is 56, so I am a bit low.",
      "You should eat 5g of sugar or a fast acting glucose like a fruit juice.",
      "Yes, I will eat something now. How did you think about the glucose level?",
      "When you wake up in the middle of the night and you cannot sleep even though you are tired is because your body is not ok.",
      "Nice to know. Next time I will check my glucose for sure.",
      "Great, but be careful. You may need to eat something else.",
      "Yes, I will also eat a banana. Thanks.",
      "You're wellcome. Good night.",
      "Good night.",
      "How was your afternoon? What did you do?",
      "Oh hi! My afternoon was amazing, I went to a rock concert with my girlfriend.",
      "That is really cool.",
      "Yes, and we also had some beers during the concert. It was amazing.",
      "That sounds really good.",
      "Yes, but now my glucose level is a bit high.",
      "Could this be related to the beers?",
      "I am sure that is the cause. I also danced in the concert, so I didn't put any insulin during the concert.",
      "Seems that the exercise you did while dancing in the concert wasn't enough to lower your glucose level.",
      "No, so now I have to inject some insulin.",
      "Be careful. Even if you have high glucose right now, you still did some exercise and it could affect your glucose later.",
      "Well thought!! I will decrease my insulin dose a little bit.",
      "Okay, but don't forget to check your glucose level one and a half hours after the insulin injection.",
      "Don't worry, I will.",
      "Great to hear. Have a good night.",
      "You too, good night.",
      "Hey, what are you doing right now?",
      "Hi, I just finished cooking the lunch for today.",
      "What did you prepare?",
      "I cooked a whole turkey in the oven with some potatoes.",
      "It sounds delicious. I assume you are not gonna eat a whole turkey alone?",
      "Of course not! I am inviting my family for lunch.",
      "I hope you have a wonderful lunch. Don't forget to inject a correct dose of insulin, potatoes have a lot of carbohidrates.",
      "Yes, I already thought about that, so I will increase my insulin dose today.",
      "Fantastic. Don't forget to measure your blood glucose level one hour and a half after your lunch.",
      "I will set an alarm so I don't forget about that. My family is coming, so I have to leave you now.",
      "Enjoy your lunch with your family. Bye.",
      "Thank you, goodbye.",
      "Hi, how are you?",
      "Everything fine. And you?",
      "I'm very tired today.",
      "What did you do?",
      "I worked all day in a storehouse packing material and moving boxes.",
      "Wow, it seems you had an exhausting day. Could you control your glucose fine?",
      "I measured my glucose before lunch and I was quite good, at 85. However, I didn't check it again since then.",
      "You should check it again now, you did a lot of exercise. What did you eat for lunch?",
      "I had a salad and a steak with potatoes, and I injected 5 units of fast action insulin.",
      "You should check your glucose level again now, maybe you didn't eat enough carbohidrates.",
      "It seems I didn't, I am at 46 now. What should I eat?",
      "Since no fast action insulin is acting now, you should improve only by having 5 g of sugar or 200 cl of juice with sugar.",
      "Ok I will go to eat now. See you later.",
      "See you, goodbye.",
      "Hey, how is your day going?",
      "Not bad, and yours?",
      "I'm also fine, but somehow I don't feel quite well.",
      "Oh, I'm sorry. Why is that?",
      "Because no matter how much water I drink, I still feel thirsty.",
      "That is a common symptom of having a high blood glucose level. Have you checked it?",
      "No, I didn't check it. I actually drank a beer one hour ago, could this be affecting my glucose?",
      "Yes, that beer is definetely the cause for your thirst. However, you should check your glucose.",
      "Ok, I did check it and I was at 320, quite high. I'm gonna put some fast action insulin to be good again.",
      "Yes, but measure your insulin dose carefully or you may get down on blood glucose.",
      "I have injected 7 units of insulin. I hope the thirst disappears soon.",
      "I'm sure it will. Think about this the next time you drink a beer.",
      "Sure I will, thanks for your help.",
      "You're welcome, you can contact me anytime you feel like this.",
      "See you later, bye.",
      "Goodbye.",
      "Hi, how are you feeling today?",
      "My head is a bit dizzy. I think my glucose is low.",
      "I think so too, you should eat something to raise your glucose.",
      "I was thinking about eating some cheese.",
      "Cheese is tasty, but it's not the best thing for you right now. You have to eat a bit of sugar, or a juice.",
      "Ok, but I really want to eat cheese.",
      "Then you should eat the cheese with some bread, it will also help to raise your glucose.",
      "I will do that.",
      "But first you should drink a juice, it will make you feel better.",
      "Ok, I will drink a juice and eat bread with cheese.",
      "Right, but be careful with the bread, too much could raise your glucose too much.",
      "I will only have a slice of bread.",
      "Perfect, enjoy your food.",
      "Thank you, bye.",
      "Hey, how are you?",
      "I'm fine, and you?",
      "Also fine. What are you doing?",
      "I have just finished cooking my dinner.",
      "What did you cook for dinner?",
      "I grilled chicken breast and also cooked some rice.",
      "That sounds good, but do you know that rice has a lot of carbohidrates?",
      "Yes I do, so I will inject a higher than usual dose of insulin.",
      "Great, but don't forget to measure your blood glucose level one hour and a half after your insulin injection.",
      "I will measure it, because last time I didn't do it and my glucose rose higher than I wanted.",
      "You have to be careful with some food like potatoes, rice or pasta.",
      "Yes. I will leave now, my chicken will cool if I wait more.",
      "Okay, enjoy your dinner. Talk to you tomorrow.",
      "Ok, goodbye.",
      "Hello, how are you?",
      "I'm great, and you?",
      "Quite bad, my blood glucose is really high.",
      "You should inject insulin to reduce your blood glucose.",
      "I know, but I'm going to a football match now and I don't want to have a low glucose level during the match.",
      "But if you don't inject insulin it is possible that you have a high glucose for a long time, and you won't feel good.",
      "Ok, then what should I do?",
      "You should speak with your doctor to be certain on what to do.",
      "Yes, I will speak with him and try to improve my blood glucose level.",
      "I hope you win your football match.",
      "I hope so too. See you later.",
      "Bye, see you soon.",
      "Hello!",
      "Hey, what's up?",
      "I'm very nervous. What about you?",
      "I'm fine. Why are you so nervous?",
      "I have a very important exam this afternoon and I cannot fail.",
      "Have you studied for your exam?",
      "Yes, I have studied but I haven't been able to control my glucose lately. I fear to be low during my exam.",
      "How is your blood glucose level now?",
      "It is good, 92. But I don't know if it will reduce until my exam.",
      "Maybe you could eat something with low carbohidrate amount to raise a little bit your blood glucose.",
      "Yes, I want to do that but I don't know what to eat.",
      "Maybe a small biscuit or some fruit, no more than 5g of carbohidrates.",
      "Great, I will eat a small banana then.",
      "Enjoy your banana and good luck on your exam.",
      "Thank you, see you later.",
      "Later.",
      "Hey!!",
      "Hello, how are you feeling today?",
      "Great, and you?",
      "I feel horrible today. Yesterday I had a big party and today I have hangover.",
      "If you feel really bad, you could take an ibuprofen. How was your party?",
      "It was great, we played some drinking games, ate some pizzas and danced till the morning.",
      "It sounds amazing. Did you check your glucose during the party?",
      "No, I checked it before going to bed and I was quite high, so I had to inject insulin.",
      "And what was your glucose level when you woke up?",
      "I was still high, but I should be fine.",
      "Did you inject your slow action insulin?",
      "I should have, but I don't really remember if I injected during the party.",
      "That could explain why you woke up high. You should speak with your doctor to know what you should do.",
      "Yes, I will. At least this will make my hangover better.",
      "Definetely. I hope you get better soon.",
      "Thanks, talk to you later."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any organizations that support diabetes patients in Vietnam?",
      "Yes. In Vietnam, key organizations supporting diabetes patients include: VADE (Vietnam Association of Diabetes and Endocrinology) – offers education and the iCARE+ app for self-care. DiaB Program – provides coaching, lifestyle tracking, and mobile support. PATH & Access Accelerated – runs community screening and care hubs. World Diabetes Foundation – supports training and mobile clinics for foot and eye care. Novo Nordisk Vietnam – runs awareness campaigns and patient education."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is medical nutrition and what are its applications for patients?",
      "Medical nutrition is a specialized diet plan designed to support treatment of specific health conditions. For patients, it helps: Control blood sugar (in diabetes). Manage weight and improve insulin sensitivity. Support healing after surgery or illness. Reduce complications in chronic diseases (e.g., heart, kidney). Boost immunity and energy levels. It's tailored by a doctor or dietitian based on the patient’s condition, needs, and goals."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are diabetics exempt from health insurance fees?",
      "No, diabetics in Vietnam are not fully exempt from health insurance fees. However, they receive partial coverage for medications and tests under certain conditions."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How to integrate into the community when living with diabetes?",
      "To integrate into the community with diabetes: Be open (if comfortable) about your condition to build understanding, Join support groups or diabetes clubs for shared experiences, Participate in community events—bring snacks, plan ahead, Educate others when appropriate to reduce stigma, Stay active in hobbies, sports, or volunteering. Involve family and friends in your care routine. Living fully and confidently helps normalize diabetes in daily life."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should I bring to control my disease when traveling far away from home?",
      "When traveling far from home, bring: All medications and insulin, with extras, Glucometer or CGM and enough test strips, Snacks and glucose tablets for low blood sugar, Doctor’s letter and prescriptions, Medical ID (bracelet or card), Cold storage (insulated bag/ice pack) for insulin, List of emergency contacts and nearest clinics. Prepare well to stay safe and manage your diabetes confidently while traveling."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should they do if they forget to bring medicine when going out?",
      "If a person with diabetes forgets their medicine when going out: Stay calm and avoid sugary or high-carb foods, Buy food that won’t spike blood sugar (e.g., salad, protein-rich snacks), Drink water and stay hydrated. Return home as soon as possible or contact someone for help. If symptoms occur (e.g. dizziness, thirst), seek medical care immediately. Next time, keep a small emergency kit in your bag or car. Being prepared helps avoid risks."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does drinking unsweetened tea have any effect?",
      "Yes, drinking unsweetened tea is generally good for people with diabetes: No sugar or calories → doesn’t raise blood sugar, Some teas (like green or black tea) may improve insulin sensitivity, Herbal teas (e.g., chamomile, cinnamon) may help with digestion or stress. Avoid adding sugar, milk, or creamers. Drink in moderation and stay hydrated."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the difference between glucose and fructose?",
      "Glucose is the body’s main energy source and raises insulin. Fructose is processed in the liver and doesn’t raise insulin much but may increase fat if consumed in excess. Both are simple sugars—fructose is sweeter and found in fruit and hon"
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there an app that helps people with diabetes record their eating habits?",
      "Yes. Helpful apps for tracking eating habits in diabetes include: mySugr – logs meals, blood sugar, and provides insights. Undermyfork – photo-based food diary linked to glucose trends. Glucose Buddy – tracks meals, glucose, and activity. GoCoCo – helps avoid ultra-processed foods, ideal for Type 2. Glooko – integrates food, meds, and glucose data. All are available on iOS and Android."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can district hospitals handle severe complications?",
      "District hospitals can manage moderate complications, but severe cases (e.g., diabetic coma, advanced kidney or eye disease) are usually referred to provincial or central hospitals for specialized care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should I bring a blood glucose meter when going to the temple or a long festival?",
      "Yes, you should bring a blood glucose meter when going to the temple or a long festival. It helps you: Monitor blood sugar if you feel unwell or eat unfamiliar food. Prevent hypoglycemia or hyperglycemia. Stay safe during long activities, especially in hot weather or crowded places. Also bring snacks, water, and any medication for full preparation."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How is type 1 diabetes different from type 2 diabetes?",
      "Type 1 diabetes is an autoimmune condition where the pancreas produces little or no insulin, often diagnosed in children or young adults. Type 2 diabetes is caused by insulin resistance and relative insulin deficiency, commonly associated with obesity and adult onset. Type 1 requires lifelong insulin; Type 2 may be managed with lifestyle, oral meds, or insulin."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do hormonal changes affect blood sugar?",
      "Yes, hormonal changes affect blood sugar: Stress hormones (cortisol, adrenaline) raise blood sugar, Menstrual cycle and pregnancy hormones can cause fluctuations, Thyroid or adrenal disorders also impact glucose control. Monitoring and adjusting treatment during these times helps maintain stability."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is a low-carb diet safe for people with diabetes?",
      "Yes, a low-carb diet is generally safe and effective for people with diabetes. It can help: Lower blood sugar levels, Improve insulin sensitivity, Support weight loss. However, it should be balanced and guided by a doctor or dietitian to ensure proper nutrition and medication adjustment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is gestational diabetes?",
      "Gestational diabetes is high blood sugar that develops during pregnancy, usually in the 2nd or 3rd trimester. It’s caused by hormonal changes that impair insulin action. It usually resolves after birth but increases the mother’s and baby’s risk of developing Type 2 diabetes later."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do you need to get a flu or pneumococcal vaccine?",
      "Yes, people with diabetes should get the flu and pneumococcal vaccines. Diabetes weakens the immune system, increasing the risk of serious complications from flu or pneumonia. Annual flu shots and pneumococcal vaccines (as recommended by your doctor) are important for protection."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the target postprandial blood sugar level?",
      "For most people with diabetes, the target postprandial (after meal) blood sugar level is: Below 180 mg/dL (10.0 mmol/L), Measured 1–2 hours after eating. Targets may vary by individual—follow your doctor’s guidance."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Why does diabetes slow wound healing?",
      "Diabetes slows wound healing because: High blood sugar damages blood vessels, reducing oxygen and nutrients to the wound. Nerve damage (neuropathy) delays detection of injuries. Weak immune response increases infection risk. Poor circulation slows cell repair. Good blood sugar control and proper wound care help healing."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there a link between obesity and diabetes?",
      "Yes, there is a strong link between obesity and type 2 diabetes. Excess body fat, especially around the abdomen, leads to: Insulin resistance, Higher blood sugar levels, Increased inflammation. Losing even 5–10% of body weight can significantly reduce the risk of developing diabetes or improve control if already diagnosed."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How to explain diabetes to children?",
      "Diabetes means the body has trouble using sugar from food. So we help it by eating healthy, staying active, and sometimes taking medicine or insulin. It’s not contagious, and with care, people with diabetes can do everything others can."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should diabetes education be applied from primary school?",
      "Yes. Diabetes education in primary school helps: Build early awareness of healthy habits, Prevent obesity and type 2 diabetes later, Reduce stigma toward diabetic peers. Early education supports lifelong health and prevention."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How does personalized medicine apply to diabetics?",
      "Personalized medicine for diabetics means tailoring treatment based on: Genetics, Lifestyle, Blood sugar patterns, Other health conditions. It helps choose the best medications, diet, and exercise plans for each person, improving control and reducing complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there differences in HbA1c levels in Asians?",
      "Yes, studies show Asians may have slightly higher HbA1c levels than other groups at the same blood glucose levels. This may be due to differences in: Red blood cell lifespan, Hemoglobin variants, Body composition and metabolism. Doctors consider these factors when interpreting results. HbA1c is still useful but may be combined with other tests for accuracy."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does taking antihypertensive drugs affect blood sugar?",
      "Yes, some antihypertensive drugs can affect blood sugar: Thiazide diuretics and beta-blockers may slightly raise blood sugar, Others like ACE inhibitors or ARBs may improve insulin sensitivity. Your doctor will choose the right medication to balance both blood pressure and glucose control."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do you need regular dental checkups?",
      "Yes, people with diabetes need regular dental checkups (at least every 6 months). High blood sugar increases the risk of gum disease, infections, and slow healing in the mouth. Good oral care helps prevent complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can a family doctor network monitor diabetes patients?",
      "Yes, a family doctor network can monitor diabetes by: Providing regular check-ups and screenings, Managing medications and lifestyle counseling, Coordinating referrals for complications, Offering ongoing support for blood sugar control. It ensures continuous, personalized care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How do I know if I have diabetes?",
      "You should get a blood test. Common tests include: Fasting Blood Glucose ≥ 126 mg/dL, HbA1c ≥ 6.5%, Random Glucose ≥ 200 mg/dL with symptoms, Oral Glucose Tolerance Test (OGTT) ≥ 200 mg/dL at 2 hours. Diagnosis must be confirmed by repeat testing or presence of symptoms."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the side effects of Metformin?",
      "Common side effects of Metformin include: Stomach upset: nausea, bloating, diarrhea. Loss of appetite. Metallic taste in the mouth. Vitamin B12 deficiency with long-term use. Rare but serious: lactic acidosis (very low risk, more likely in kidney or liver problems). Taking it with food helps reduce stomach symptoms. Always follow your doctor’s guidance."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the complications of diabetes?",
      "Complications include: Cardiovascular disease (heart attack, stroke), Neuropathy (nerve damage), Nephropathy (kidney failure), Retinopathy (blindness), Foot ulcers and amputations, Infections and delayed wound healing. Good glucose control helps prevent these."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should I divide my meals when going to school/work?",
      "Yes, you should divide your meals when going to school or work. Eating smaller, more frequent meals helps: Maintain stable blood sugar. Prevent hypoglycemia or spikes. Support energy and focus throughout the day. Pack healthy snacks (e.g., nuts, yogurt, fruit) and eat every 3–4 hours if possible."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should they eat breakfast before measuring their blood sugar?",
      "No. They should measure blood sugar before eating breakfast—this is called the fasting blood sugar test. It gives a clear picture of overnight glucose control. Measure before food or drink (except water)."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should you take vitamin supplements?",
      "Vitamin supplements can be helpful if you have deficiencies, but for most people with diabetes: A balanced diet usually provides enough vitamins. Vitamin D, B12, and magnesium supplements may be recommended by your doctor. Avoid unnecessary supplements without medical advice. Always consult your healthcare provider before starting any vitamins."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can diabetes be cured?",
      "Type 1 diabetes cannot be cured—lifelong insulin is needed. Type 2 diabetes is not cured but can be put into remission with weight loss, diet, and exercise. Gestational diabetes usually resolves after delivery but increases future diabetes risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is weight gain dangerous for people with diabetes?",
      "Yes, weight gain is dangerous for people with diabetes because it: Increases insulin resistance, Raises blood sugar and worsens control, Raises risk of heart disease and other complications. Maintaining a healthy weight is key to managing diabetes effectively."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is a diabetic diet?",
      "A diabetic diet focuses on controlling blood sugar. It includes: High-fiber, low-GI carbs (e.g., whole grains, vegetables), Lean proteins (e.g., fish, poultry, legumes), Healthy fats (e.g., olive oil, nuts), Limited sugar, refined carbs, and saturated fat, Portion control and regular meal timing. Goal: stabilize blood glucose and support overall health."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should I walk after dinner?",
      "Yes, walking after dinner is highly recommended for people with diabetes. It helps: Lower post-meal blood sugar. Improve insulin sensitivity. Aid digestion and weight control. A light walk for 15–30 minutes is ideal. Make it part of your daily routine."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is diabetes considered a disability?",
      "Yes, diabetes is considered a disability if it significantly limits daily activities. In Vietnam, it qualifies for support under the Law on Persons with Disabilities."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes hide their disease?",
      "No. Hiding diabetes can be risky, especially in emergencies. Openly managing it allows others to help if needed and reduces stress. Sharing with employers, teachers, or close contacts ensures safety and support. There's no shame—it's a medical condition, not a weakness."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can CRISPR cure type 1 diabetes?",
      "CRISPR shows promise for treating, and potentially curing, type 1 diabetes, by: Editing genes to protect or restore insulin-producing beta cells, Possibly creating immune-resistant beta cells from stem cells, Reducing the immune attack that causes type 1 diabetes. However, it's still in early research and clinical trials. More studies are needed before it becomes a routine treatment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can I eat rice if I have diabetes?",
      "Yes, but in moderation. Choose whole grain or brown rice, control portions (about ½ cup cooked), and pair it with fiber, protein, and healthy fat to reduce blood sugar spikes. Avoid large amounts of white rice."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How many meals should people with diabetes eat each day?",
      "Typically, 3 main meals and 1–2 small snacks per day help maintain stable blood sugar. Meals should be evenly spaced (every 4–5 hours) and balanced in carbs, protein, and fat. Individual needs may vary—follow your doctor or dietitian’s advice."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are people at risk of cancer?",
      "Yes, people with diabetes—especially type 2—have a higher risk of certain cancers, including: Liver, Pancreatic, Colorectal, Breast, Endometrial. Possible reasons: high insulin levels, chronic inflammation, and obesity. Good diabetes control and a healthy lifestyle can help lower this risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the effect of sleep on blood sugar control?",
      "Sleep greatly affects blood sugar control: Too little or poor sleep increases insulin resistance, Raises risk of high blood sugar and cravings for unhealthy food, Good sleep (7–8 hours) helps maintain stable glucose levels and improves hormonal balance. Quality sleep is essential in managing diabetes effectively."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any studies in Vietnam on diabetes?",
      "Yes, Vietnam has several diabetes studies focusing on: Education programs to improve HbA1c, Digital care tools for better glucose control, Community support models (e.g., peer groups), Quality-of-life and prevalence research. These support better management and awareness across urban and rural areas."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does the Vietnam Endocrine Society organize annual seminars?",
      "Yes, the Vietnam Endocrine Society (VADE) organizes annual scientific conferences on diabetes and endocrinology, held in major cities across the country."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "If there is a small wound, how should the patient take care of it?",
      "If a person with diabetes has a small wound: Clean it gently with mild soap and water. Dry the area and apply an antiseptic. Cover with a clean bandage to protect it. Check it daily for redness, swelling, or pus. Avoid walking barefoot, especially if it's on the foot. See a doctor if it doesn’t heal in a few days or shows signs of infection. Prompt care prevents complications like ulcers or infection."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Which celebrities are living healthily with diabetes?",
      "Several celebrities live actively and successfully with diabetes, showing it’s manageable. Examples include: Nick Jonas – Diagnosed with Type 1 diabetes at age 13; openly shares his management journey. Halle Berry – Lives with Type 2 diabetes; follows a strict diet and fitness routine. Tom Hanks – Has Type 2 diabetes; manages it with lifestyle changes. Larry King – Had Type 2 diabetes and advocated for awareness during his lifetime. Selena Gomez – Though she has lupus, she’s also publicly supported diabetes awareness due to close connections. Jay Cutler – Former NFL quarterback with Type 1 diabetes who played at a professional level. Sonia Sotomayor – U.S. Supreme Court Justice with Type 1 diabetes since childhood. Their success proves that with the right care, people with diabetes can live full, high-achieving lives."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should be checked when newly diagnosed with diabetes?",
      "At diagnosis, the following should be checked: HbA1c (glucose control), Fasting lipid profile (cholesterol), Kidney function (creatinine, urine albumin), Liver function tests, Blood pressure, Eye exam (retinopathy), Foot exam (neuropathy, circulation), Weight and BMI, Vaccination status (e.g., flu, hepatitis B). These guide treatment and prevent complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do they need to take medication for life when they have diabetes?",
      "Type 1: Yes, lifelong insulin is required. Type 2: Often yes, but some can reduce or stop medication with lifestyle changes and weight loss. Medication needs may change over time. Always follow your doctor's plan."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How is hypoglycemic coma different?",
      "Hypoglycemic coma is caused by very low blood sugar (rapid onset); Hyperglycemic coma is caused by very high blood sugar (gradual onset). Hypo = sweating, shaking, confusion → treat with sugar; Hyper = thirst, dry skin, drowsiness → treat with fluids + insulin. Both are emergencies."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can patients eat buffets?",
      "Yes, patients with diabetes can eat at buffets with caution: Survey the options first, then choose wisely. Fill half the plate with non-starchy vegetables. Choose lean proteins (grilled, not fried). Limit white rice, noodles, desserts, and sugary drinks. Control portions—small tastes, not large servings. Eat slowly and stop when full. Monitor blood sugar afterward if possible."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should people with diabetes say to their lover?",
      "People with diabetes can say to their lover with honesty and warmth: “I have diabetes. It doesn’t define me, but it’s part of my life. I manage it every day with care, and your support means a lot. I’m sharing this because I trust you, and I want you to know I’m healthy, active, and living fully—just with a few extra steps.”. Keep it open, calm, and confident. Most partners will appreciate the honesty and want to support you."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "When should I switch from medication to insulin?",
      "You may need to switch from medication to insulin when: Oral drugs no longer control blood sugar (e.g., HbA1c stays high), You experience severe symptoms (e.g., weight loss, fatigue, frequent urination), During pregnancy or major illness, You have kidney or liver problems, At diagnosis if blood sugar is very high. Your doctor will decide based on your condition and response to treatment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does exercise help control blood sugar?",
      "Yes. Exercise increases insulin sensitivity and helps muscles use glucose, lowering blood sugar. Aim for at least 150 minutes/week of moderate activity like walking, cycling, or swimming."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should I do if I have hypoglycemia while driving?",
      "If you have hypoglycemia while driving: Pull over safely and stop the car immediately. Check your blood sugar. If it's <70 mg/dL (3.9 mmol/L), eat 15g of fast-acting carbs (e.g., juice, glucose tablets). Wait 15 minutes, then recheck. Only resume driving when blood sugar is normal and you feel alert. Never drive if you feel symptoms (sweating, shaking, dizziness). Always keep glucose supplies in the car."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of demographic research in diabetes control?",
      "Demographic research helps diabetes control by: Identifying high-risk groups (age, gender, income, location), Guiding targeted prevention programs, Supporting resource planning and healthcare access, Tracking trends in incidence and complications. It ensures policies are data-driven and population-specific."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can patients eat spicy food?",
      "Yes, people with diabetes can eat spicy food if they tolerate it well. Spices like chili, turmeric, or garlic do not raise blood sugar. Avoid dishes that are also greasy, salty, or sugary. If spicy food causes stomach issues (like acid reflux or diarrhea), limit it. Eat in moderation and monitor how your body responds."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is fast food harmful to diabetics?",
      "Yes, most fast food is high in refined carbs, unhealthy fats, sodium, and added sugars, which can spike blood sugar and worsen diabetes control. Occasional choices should be portion-controlled, with grilled proteins, salads, and no sugary drinks."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there an early retirement policy for the seriously ill?",
      "Yes. In Vietnam, seriously ill workers (e.g. with ≥ 81% disability or severe chronic disease) may qualify for early retirement with a pension or lump-sum payout, based on social insurance contributions."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are insulin injections mandatory for all diabetics?",
      "No. Type 1: Yes, insulin is mandatory for life. Type 2: Not always. Many manage with diet, exercise, and oral meds. Insulin may be needed if other treatments fail or during illness, surgery, or pregnancy. Treatment depends on individual condition and blood sugar levels."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How long does it usually take to treat diabetes?",
      "Diabetes is a chronic condition, not cured but managed for life. Type 1: Requires lifelong insulin and monitoring. Type 2: Can be controlled or even reversed (remission) with lifestyle and/or medication, but ongoing care is essential. Early control helps prevent long-term complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does the nursing training curriculum include diabetes?",
      "Vietnam’s nursing curriculum and continuing education actively cover diabetes, with hands‑on training, specialized courses, and digital learning programs to prepare nurses for diabetes management and education at all levels of care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How should elderly people with diabetes be cared for?",
      "Elderly people with diabetes should be cared for with: Simplified treatment plans to avoid hypoglycemia. Regular monitoring of blood sugar, blood pressure, and kidney function. Balanced meals with easy-to-digest, low-GI foods. Medication review to avoid interactions. Foot care, eye exams, and dental checks. Fall prevention and physical activity suited to age. Emotional support and regular health check-ups. Personalized, gentle care improves safety and quality of life."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the nutritional regimen for people with type 2 diabetes?",
      "A type 2 diabetes diet should focus on: Low-glycemic carbs: whole grains, legumes, non-starchy vegetables, Lean protein: fish, chicken, tofu, eggs, Healthy fats: olive oil, avocado, nuts, Fiber-rich foods: vegetables, fruits with skin, oats, Limit: sugar, white flour, processed foods, salty/fried items, Meal timing: regular meals/snacks to maintain stable blood sugar. Personalized by a dietitian for best results."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes work as long-distance drivers?",
      "Yes, but with strict management. People with diabetes can work as long-distance drivers if: Blood sugar is well-controlled, They have no history of severe hypoglycemia. They monitor glucose before and during driving. They follow regulations set by local transport or licensing authorities. Medical clearance is usually required. Safety comes first."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can we reduce treatment costs?",
      "To reduce diabetes treatment costs: Use health insurance for covered meds and tests, Choose public hospitals or community clinics, Follow a healthy lifestyle to avoid complications, Use generic medications when possible, Join support programs offering free or subsidized care. Prevention and early control are the most cost-effective."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What factors affect the accuracy of blood glucose meters?",
      "Factors affecting the accuracy of blood glucose meters include: Expired or damaged test strips, Improper storage of strips or meter (heat, humidity), Dirty meter or hands during testing, Low hematocrit levels (anemia), High altitude or extreme temperatures, Medications (e.g., vitamin C, acetaminophen), Incorrect coding (for some older meters). Always follow the manufacturer’s instructions and calibrate when required."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can people who are not tech-savvy monitor their disease?",
      "People who aren't tech-savvy can monitor diabetes using: A simple glucometer with a paper logbook, Printed charts to track blood sugar, meals, and medication, Regular clinic visits for checks and guidance, Family, friends, or community health workers for support, Reminder notes or pillboxes for medications and routines. Basic tools and a consistent routine work well without technology."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes eat bananas?",
      "Yes, but in moderation. Bananas have natural sugar and moderate glycemic index. Choose small-sized, eat half at a time, and pair with protein or fat (e.g., nuts) to slow absorption. Avoid overripe bananas."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should patients prepare when traveling abroad?",
      "When traveling abroad, diabetes patients should prepare: Medications and insulin (with extras), Blood glucose meter or CGM and supplies, Doctor’s note for airport security and prescriptions, Snacks and glucose tablets for emergencies, Medical ID (bracelet or card), Time zone plan for insulin or meds, Travel insurance covering diabetes care. Plan ahead to stay safe and manage diabetes confidently while abroad."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can I live a healthy and normal life with diabetes?",
      "Yes, absolutely. With good blood sugar control, a healthy lifestyle, and regular check-ups, people with diabetes can live a normal, active, and healthy life, avoiding or delaying complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What causes diabetes?",
      "Diabetes is caused by either autoimmune destruction of insulin-producing beta cells (Type 1), insulin resistance combined with impaired insulin secretion (Type 2), or hormonal changes during pregnancy (gestational diabetes). Genetics, obesity, inactivity, and certain medications also contribute."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is diabetes hereditary?",
      "Yes, genetics play a role. Type 1 has a genetic risk but is mostly autoimmune. Type 2 has stronger hereditary links, especially with family history, combined with lifestyle factors."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is diabetes related to dyslipidemia?",
      "Yes, diabetes is closely related to dyslipidemia—abnormal blood fat levels. Common patterns in diabetic dyslipidemia: High triglycerides, Low HDL (good) cholesterol, Small, dense LDL (bad) cholesterol. This increases the risk of heart disease. Managing blood sugar, diet, and using medications like statins helps control it."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there a network of hospitals specializing in diabetes in Vietnam?",
      "Yes, Vietnam has a diabetes care network led by the National Hospital of Endocrinology, with specialized units in major and provincial hospitals. They offer standardized treatment, training, and nationwide support."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What foods should they avoid when they have diabetes?",
      "People with diabetes should avoid or limit: Sugary drinks (soda, sweet tea, fruit juice), Refined carbs (white bread, pastries, candy), Fried and fast food, Processed meats (sausages, bacon), Full-fat dairy and trans fats, Excess salty foods (chips, instant noodles). Choose whole, fresh, and nutrient-dense options instead."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can I eat sugar-free bread?",
      "Yes, you can eat sugar-free bread, but check the carbohydrate content and glycemic index. Choose breads that are: Whole grain or low-GI, High in fiber, Low in refined flour, Even sugar-free bread can affect blood sugar—portion control is key."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How to eat properly when having to entertain guests often?",
      "When entertaining guests often, eat properly by: Planning ahead: Eat a healthy meal or snack before the event. Choosing wisely: Focus on vegetables, lean protein, and small portions of carbs, Limiting alcohol and sugary drinks. Avoiding overeating: Use a small plate, eat slowly, and stop when full. Bringing or suggesting healthier dishes if possible. Stay mindful and enjoy social events without compromising your health."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the current focus of new clinical trials?",
      "Current diabetes clinical trials focus on: Beta-cell regeneration using stem cells and gene editing (type 1), Oral GLP-1 drugs like orforglipron (type 2), Immunotherapy to delay or stop type 1 diabetes, AI-powered insulin delivery systems, Gut-targeted metabolic treatments, Kidney and heart-protective therapies. These aim to improve control, reduce complications, and move toward a cure."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can the patient work night shifts?",
      "Yes, people with diabetes can work night shifts, but it requires careful management: Maintain regular meals and medication timing, adjusted to your new schedule, Monitor blood sugar more frequently, especially during the shift, Prepare healthy snacks to avoid highs/lows, Prioritize sleep during the day to avoid insulin resistance, Inform your doctor to adjust your treatment plan if needed. With planning, night shifts are manageable."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are peripheral neuropathy complications?",
      "Peripheral neuropathy complications in diabetes include: Numbness or tingling in hands and feet, Burning or sharp pain, Loss of balance or coordination, Foot injuries or ulcers (due to reduced sensation), Infections that may lead to amputation if untreated. Good blood sugar control and foot care help prevent these issues."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "If I work out in the morning, should I eat breakfast first?",
      "If you have diabetes and work out in the morning, it's usually best to eat a small breakfast first, especially if: You take insulin or blood sugar-lowering meds, You’re doing moderate to intense exercise. Eat a light snack with carbs and protein (e.g., banana with peanut butter, whole-grain toast with egg) to prevent low blood sugar. If your morning sugar is stable and exercise is light, some can work out before eating—but always monitor your glucose and follow your doctor’s advice."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the common misconceptions of Vietnamese people about diabetes?",
      "Common misconceptions among Vietnamese people about diabetes include: Only overweight people get diabetes – In fact, thin individuals can develop Type 2 or Type 1 diabetes, especially with family history.Diabetes is a death sentence – While serious, it can be well-managed with treatment and lifestyle changes. People with diabetes must avoid all carbs or sugar completely – Carbs can be eaten in moderation and balanced meals are key. Taking insulin means your diabetes is very bad – Insulin is a normal, effective treatment and not a sign of failure. Traditional medicine or herbs can cure diabetes – There's no cure; traditional remedies may help, but must not replace proper medical care. Diabetes only affects old people – Young adults and children can also develop diabetes, especially Type 1. Once blood sugar is normal, no need for medicine – Diabetes is chronic; stopping medication without medical advice is dangerous. Fruit is always healthy for diabetics – Some fruits raise blood sugar quickly and must be eaten in controlled portions. Education and regular medical checkups are essential to correct these beliefs."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How do epidemics like COVID-19 affect diabetes patients?",
      "Epidemics like COVID-19 affect diabetes patients by: Increasing risk of severe illness and complications. Disrupting routine care and medication access. Raising stress, which can worsen blood sugar control. Reducing physical activity during lockdowns. Good management and vaccination are essential during outbreaks."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there a platform that helps doctors monitor patients remotely?",
      "Yes, platforms like Medcomm, MySugr Pro, and Glooko allow doctors to: Remotely monitor blood sugar, medications, and lifestyle data. Track trends and receive alerts. Adjust treatment plans in real time, Communicate with patients for better follow-up. Some hospitals in Vietnam also use telehealth portals for this purpose."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What support do ordinary workers with diabetes need?",
      "Ordinary workers with diabetes need: Flexible meal and break times for glucose control, A place to check blood sugar and take medication, Understanding from employers about their condition, Access to healthy food and hydration at work, Medical leave for check-ups or complications, Emotional support and non-discrimination in the workplace. These help them stay healthy and work effectively."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can diabetics drink coffee?",
      "Yes, diabetics can drink coffee in moderation. Black coffee (without sugar/cream) has minimal impact on blood sugar. Avoid sweetened or flavored coffee drinks. Monitor blood sugar—caffeine may raise it in some people. Drink with meals and stay hydrated."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does diabetes affect fertility?",
      "Yes. Diabetes can affect fertility in both men and women. Women: Irregular periods, hormonal imbalance, higher miscarriage risk, Men: Erectile dysfunction, reduced sperm quality. Good blood sugar control improves reproductive health and pregnancy outcomes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is diabetic foot syndrome?",
      "Diabetic foot syndrome is a complication of diabetes involving: Nerve damage (neuropathy) → loss of sensation, Poor blood circulation → slow wound healing, Foot ulcers, infections, and risk of amputation. It often starts with unnoticed injuries. Prevention includes daily foot checks, proper footwear, blood sugar control, and regular doctor visits."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any apps that track meals and suggest adjustments?",
      "Yes, there are several apps that track meals and suggest adjustments for people with diabetes, such as: MyFitnessPal, Carb Manager, Glucose Buddy, MySugr. They help log food, monitor carbs, and sometimes offer personalized advice to improve blood sugar control."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the research on the effects of tobacco on people with diabetes?",
      "Research shows tobacco use worsens diabetes by: Increasing insulin resistance. Raising blood sugar levels. Damaging blood vessels, leading to complications (heart, kidney, eye). Slowing wound healing. Smoking significantly raises the risk of complications and early death in diabetics. Quitting is strongly advised."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do children with diabetes need to eat before physical education?",
      "Yes. Children with diabetes should eat a small snack (with carbs and some protein) before physical education to prevent low blood sugar during or after activity. They should also: Check blood sugar before and after PE, Have quick sugar (like juice or glucose tabs) nearby, Inform the PE teacher about their condition, Proper planning keeps them safe and active."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are smartwatches accurate at monitoring blood sugar?",
      "Currently, most smartwatches cannot accurately monitor blood sugar on their own. Some devices estimate glucose trends using sensors, but they are not as reliable as blood glucose meters or continuous glucose monitors (CGMs). CGMs remain the gold standard for real-time, accurate blood sugar tracking. Smartwatches can help track related factors (activity, heart rate) but not replace medical glucose testing yet."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does diabetes increase the risk of stroke?",
      "Yes. Diabetes increases the risk of stroke by damaging blood vessels and promoting atherosclerosis (plaque buildup). High blood sugar, high blood pressure, and abnormal cholesterol levels in diabetes all contribute to stroke risk. Good control reduces this risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes participate in social activities?",
      "Yes, absolutely. People with diabetes should and are encouraged to participate in social activities. It supports: Emotional well-being, Stress reduction, Physical activity, if active events are involved, A sense of normalcy and connection. They just need to plan ahead—bring snacks, monitor blood sugar, and inform close friends if necessary."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are the signs of diabetes different in the elderly than in young people?",
      "Yes. In the elderly, diabetes signs may be subtle or atypical, such as: Fatigue, confusion, or memory issues, Unexplained weight loss, Frequent infections, Dehydration or incontinence. Classic symptoms (thirst, urination, hunger) may be less noticeable. Regular screening is important."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any international collaborations to help Vietnamese patients?",
      "Yes, Vietnam has several international collaborations supporting diabetes care: World Diabetes Foundation (WDF): Funds training and foot-care programs, IDF & Sanofi (iSTEP-D): Provides online diabetes education for doctors and nurses, PATH & Access Accelerated: Improve primary care and screening access, Roche-VPA: Supports children with Type 1 diabetes via insulin and education programs. These partnerships enhance training, access, and care quality nationwide."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there an online community that shares experiences of living with diabetes?",
      "Yes. Online communities for sharing diabetes experiences include: TuDiabetes, Diabetes Daily, Diabetes.co.uk Forum, HealthUnlocked, Reddit (e.g., r/diabetes). They offer support, tips, and real-life stories from people living with diabetes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does protein affect blood sugar?",
      "Protein has minimal direct effect on blood sugar but: Helps stabilize blood sugar when eaten with carbs, Can raise blood sugar slightly and slowly if eaten in large amounts, Is important for muscle and healing. Include lean protein in every meal for better glucose control."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do people with diabetes have difficulty finding a job?",
      "Generally, no—diabetes does not prevent employment. Most people with diabetes can work in nearly all professions with proper management. However, some safety-sensitive jobs (e.g., pilots, military roles) may have restrictions. Employers must follow anti-discrimination laws in most countries."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the OGTT test and when is it used?",
      "The OGTT is a test to diagnose diabetes or prediabetes. You drink a sugar solution, and blood sugar is measured before and 2 hours after. High results mean impaired glucose tolerance or diabetes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should they drink milk if they have diabetes?",
      "Yes, in moderation. Choose low-fat or unsweetened milk. It contains carbs, so count it in your meal plan. Avoid flavored or sweetened milk, which can spike blood sugar."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Why do we have to inject insulin instead of taking medication?",
      "Insulin must be injected instead of taken as a pill because: Stomach acid destroys insulin, making it ineffective if swallowed. Injection delivers insulin directly into the bloodstream, where it can work properly. People with type 1 diabetes or advanced type 2 diabetes don’t produce enough insulin, so they need it from outside. Researchers are working on oral insulin, but injections remain the most reliable method today."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any student associations that support chronic diseases?",
      "Yes, while not widespread, student-led groups like Vietnam Health Clinic and projects like SUNI-SEA involve students in supporting chronic disease care, including diabetes, through outreach and education."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can the patient play badminton or soccer?",
      "Yes, people with diabetes can play badminton or soccer. These sports: Improve insulin sensitivity, Help control blood sugar and weight, Boost cardiovascular health. Before playing: Check blood sugar, Eat a light snack if needed, Bring glucose tablets or juice in case of hypoglycemia, Stay hydrated. Always listen to your body and consult your doctor for personalized advice."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do you need to re-measure your blood sugar after exercise?",
      "Yes, it's recommended to re-measure blood sugar after exercise, especially if: You take insulin or blood sugar-lowering meds, You did moderate to intense activity, You had symptoms like dizziness or fatigue. Exercise can lower blood sugar for hours, so monitoring helps prevent hypoglycemia and guide future workouts."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the HbA1c index and what does it mean for people with diabetes?",
      "HbA1c is a blood test that measures average blood glucose over 2–3 months. It reflects long-term control. Normal: < 5.7%. Prediabetes: 5.7–6.4%. Diabetes: ≥ 6.5%. Target for most diabetics: < 7%. Lower HbA1c = better glucose control, lower complication risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there any medicine that can cure this disease?",
      "No, there is no medicine that cures diabetes. Type 1: Requires lifelong insulin—no cure. Type 2: Some medications (like metformin, GLP-1 agonists) help control it, and in some cases, remission is possible with weight loss and lifestyle changes. Research is ongoing, but current treatment focuses on control, not cure."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How does continuous glucose monitoring (CGM) technology work?",
      "Continuous Glucose Monitoring (CGM) works by: Using a tiny sensor inserted under the skin (usually abdomen or arm), Measuring glucose levels in interstitial fluid (not blood) every few minutes, Sending data to a receiver, smartphone, or insulin pump, Providing real-time trends, alerts for highs/lows, and glucose patterns. It helps improve diabetes control and reduce hypoglycemia risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes be vegetarians?",
      "Yes, people with diabetes can be vegetarians. A well-planned vegetarian diet helps: Control blood sugar, Improve heart health, Support weight management. Focus on: Whole grains, legumes, vegetables, nuts, low-GI fruits, Limit refined carbs, sugary plant foods, and fried items. Consult a dietitian to ensure balanced nutrition."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can the patient eat low-carb instant noodles?",
      "Yes, people with diabetes can eat low-carb instant noodles occasionally, but with care: Check the nutrition label for actual carb content and added sugars. Choose ones with high fiber and protein. Avoid or use less of the seasoning packet, which may be high in salt and additives. Add vegetables or lean protein to make it more balanced. Monitor your blood sugar after eating. Use them as a quick option—not a regular meal."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How is diabetic retinopathy treated?",
      "Diabetic retinopathy is treated by: Controlling blood sugar, blood pressure, and cholesterol to slow progression. Laser therapy (photocoagulation) to seal leaking blood vessels. Anti-VEGF injections to reduce swelling and stop new vessel growth. Vitrectomy surgery for severe bleeding or retinal detachment. Early detection through annual eye exams is key."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How much sweets can people with diabetes eat safely?",
      "People with diabetes can have sweets occasionally and in small portions, ideally 10–15g of carbs per serving. Sweets should be counted into the daily carb allowance and paired with fiber or protein to reduce spikes. Prefer sugar-free or low-GI options. Always monitor blood sugar response."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should you add omega-3 to your diet?",
      "Yes, adding omega-3 (from fish like salmon, mackerel, or chia seeds) is beneficial for people with diabetes. It helps: Reduce inflammation, Lower triglycerides, Support heart health. Aim for 2 servings of fatty fish per week or consider supplements if advised by your doctor."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Why are patients susceptible to infections?",
      "People with diabetes are more susceptible to infections because: High blood sugar weakens the immune system, Poor circulation reduces healing and infection defense, Nerve damage may delay detection of wounds, Elevated glucose creates a favorable environment for bacteria and fungi. Good glucose control and hygiene help prevent infections."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does sleeping too much affect blood sugar?",
      "Yes, sleeping too much can affect blood sugar. Oversleeping (especially >9 hours) may lead to higher blood sugar due to reduced physical activity and insulin sensitivity. It can also be linked to poor glucose control and other health issues like obesity or depression. Aim for 7–8 hours of quality sleep per night and maintain a regular sleep schedule."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes go on a complete diet?",
      "No, diabetics should not go on a complete (extreme or starvation) diet. Instead, they need a balanced, structured eating plan with controlled portions, regular meals, and proper nutrients to manage blood sugar, prevent complications, and maintain overall health."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can you get osteoporosis early?",
      "Yes, people with diabetes—especially type 1 and some type 2—can develop osteoporosis earlier due to: Poor bone quality from high blood sugar, Certain diabetes medications, Nutrient deficiencies and reduced physical activity. Bone health monitoring and adequate calcium, vitamin D, plus exercise are important."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can diabetics donate blood?",
      "Yes, diabetics can donate blood if: Their blood sugar is well controlled, They are in good general health, They are not on insulin (varies by country/organization). Check local blood donation guidelines and consult your doctor before donating."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes get married?",
      "Yes, people with diabetes can and should get married if they wish. Diabetes does not prevent a healthy, loving relationship or family life. With good management and open communication, they can live fully and share a strong partnership."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is it common for blood sugar to increase when stressed?",
      "Yes, it's common. Stress triggers the release of hormones like cortisol and adrenaline, which raise blood sugar levels. This can happen even without eating. Managing stress through rest, exercise, or relaxation techniques helps keep glucose stable."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the average cost of diabetes treatment in Vietnam?",
      "In Vietnam, diabetes treatment costs: Public hospitals: ~$250/year, With complications: $380–1,000/year, Private hospitals: up to $3,500/year. Monthly cost ranges from $20–60, higher with insulin or complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How many types of insulin are there today?",
      "Today, there are four main types of insulin: Rapid-acting – works in 10–15 mins, lasts 3–5 hours (e.g., Lispro, Aspart). Short-acting – starts in 30 mins, lasts 6–8 hours (e.g., Regular insulin). Intermediate-acting – starts in 1–2 hours, lasts 12–18 hours (e.g., NPH). Long-acting – works slowly over 24+ hours (e.g., Glargine, Degludec). Some people also use pre-mixed insulins, combining types in one shot."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should I do if I have diarrhea while taking diabetes medication?",
      "If you have diarrhea while taking diabetes medication: Stay hydrated with water, electrolyte drinks, or clear broth. Monitor blood sugar closely, as diarrhea may affect absorption and glucose levels. Eat bland, low-fiber foods (e.g., rice, banana, toast). Do not stop medication unless advised by a doctor. If diarrhea lasts more than 2 days or is severe, see your doctor—some medications (e.g., metformin) may need adjustment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "When should patients have microalbuminuria testing?",
      "Patients with diabetes should have microalbuminuria testing: Once a year, starting: 5 years after diagnosis for type 1 diabetes, At diagnosis for type 2 diabetes. This test checks for early kidney damage. Regular testing helps prevent progression to kidney failure."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are SGLT2 inhibitors?",
      "SGLT2 inhibitors are oral diabetes medications that: Lower blood sugar by helping the kidneys remove excess glucose through urine. Include drugs like dapagliflozin, empagliflozin, and canagliflozin. Also help with weight loss and blood pressure reduction. Benefit heart and kidney health in some patients. Common side effects: increased urination, genital infections, dehydration. Always use under doctor supervision."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are people with diabetes psychologically affected?",
      "Yes. People with diabetes are at higher risk of stress, anxiety, depression, and diabetes distress due to the burden of daily management and fear of complications. Regular mental health support is important for overall well-being."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there genetic tests that predict the risk of developing the disease?",
      "Yes, there are genetic tests that can help predict the risk of developing diabetes, especially: Type 1 diabetes: Tests for genes like HLA-DR3, DR4, DQ8. Type 2 diabetes: Polygenic risk scores assess multiple gene variants (e.g., TCF7L2, PPARG). However, genetics is just one part—lifestyle and environment play a major role. Genetic testing is mainly used in research or special cases, not routine care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How does diabetes affect the eyes?",
      "Diabetes can damage the blood vessels in the retina, leading to diabetic retinopathy. It may cause blurred vision, floaters, and can lead to blindness if untreated. It also increases the risk of cataracts and glaucoma. Regular eye exams are essential."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the reasons for high morning blood sugar?",
      "High morning blood sugar can be caused by: Dawn phenomenon – natural hormone surge raising glucose before waking, Somogyi effect – low blood sugar at night triggers rebound high glucose, Eating late or high-carb meals before bed, Insufficient evening medication or insulin. Monitoring and adjusting treatment with your doctor helps manage it."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should diabetics eat in the morning?",
      "Diabetics should eat a balanced breakfast with: High-fiber carbs: oats, whole grain bread, Protein: eggs, Greek yogurt, tofu, Healthy fats: avocado, nuts, Non-starchy vegetables: spinach, tomatoes. Avoid sugary cereals, white bread, and fruit juices."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does diabetes cause damage to large blood vessels?",
      "Yes, diabetes can damage large blood vessels (called macrovascular complications), increasing the risk of: Heart disease (e.g., heart attack), Stroke, Peripheral artery disease (PAD), leading to poor circulation in the legs. High blood sugar over time damages blood vessel walls and promotes atherosclerosis. Good glucose, blood pressure, and cholesterol control helps prevent this."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do you need to have your thyroid checked?",
      "Yes, especially for type 1 diabetes patients. They have a higher risk of thyroid disorders (like hypothyroidism). Even in type 2 diabetes, checking thyroid function is useful if there are symptoms. A simple TSH blood test can screen for problems."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can people who stay up late control their blood sugar?",
      "People who stay up late can control their blood sugar by: Eating a light, balanced dinner with protein and fiber. Avoiding late-night snacks, especially sugary or high-carb foods. Monitoring blood sugar before bed and during the night if needed. Staying hydrated and limiting caffeine or alcohol. Keeping a consistent sleep schedule as much as possible. Adjusting medication timing with doctor’s guidance if needed. Consistency in meals, activity, and monitoring is key."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of genetic testing in early screening?",
      "Genetic testing helps in early diabetes screening by: Identifying inherited risk for type 1, type 2, or MODY. Supporting early intervention before symptoms appear. Guiding personalized prevention and treatment plans. It's especially useful for those with a family history of diabetes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Has anyone ever overcome depression when having diabetes?",
      "Yes, many people with diabetes have successfully overcome or managed depression. With the right support, it's very possible. Key factors that help include: Psychological counseling (like CBT). Support groups or talking with others facing the same challenges. Antidepressant medications, when needed. Stable blood sugar control, which can improve mood. Exercise, which naturally boosts mental health. Healthy routine and sleep. Depression with diabetes is common—but treatable. Early help leads to better health and quality of life."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is there an early warning system for complications?",
      "Yes, early warning systems for complications include: Regular screenings (e.g., eyes, kidneys, feet), Continuous glucose monitoring (CGM) alerts, AI-based tools predicting risks using health data, Telehealth follow-ups for early symptom detection. These help catch problems early and prevent severe outcomes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of online communities in raising awareness?",
      "Online communities help raise awareness by: Sharing experiences and practical tips, Educating about symptoms, treatment, and prevention, Reducing stigma through peer support, Encouraging early detection and care seeking. They empower patients and spread knowledge widely."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How should people without relatives monitor their blood sugar?",
      "People without relatives can monitor blood sugar independently by: Using a glucometer or continuous glucose monitor (CGM), Setting reminders on phones or using health apps (e.g., mySugr, Glucose Buddy), Recording results in a logbook or mobile app, Visiting local clinics or pharmacies for periodic checks, Joining support groups or getting help from community health workers if available. Consistency and using digital tools help maintain safe, independent care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How often should I have a regular health check-up?",
      "Every 3–6 months if diabetes is stable. More frequently if newly diagnosed or poorly controlled. Annual checks should include: Eye exam, Foot exam, Kidney function, HbA1c test, Cholesterol and blood pressure monitoring."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of dietitians in hospitals?",
      "Dietitians in hospitals help: Plan meals for diabetic and other patients, Customize nutrition based on medical conditions, Educate patients on healthy eating habits, Support treatment goals like blood sugar control and weight management. They are key to improving recovery and long-term health."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does walking help lower blood sugar?",
      "Yes. Walking helps lower blood sugar by improving insulin sensitivity and helping muscles use glucose more efficiently. Even a 15–30 minute walk after meals can significantly reduce post-meal sugar spikes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes eat noodles and vermicelli?",
      "Yes, in moderation. Choose whole grain, buckwheat, or low-carb noodles/vermicelli. Control portions and pair with vegetables, lean protein, and healthy fats to reduce blood sugar spikes. Avoid instant or fried varieties."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes pursue their passion for professional sports?",
      "Yes, people with diabetes can pursue professional sports with proper management. Many elite athletes (e.g., Olympic champions, pro footballers) have diabetes and succeed at the highest level by: Monitoring blood sugar closely, Adjusting insulin, meals, and hydration around training, Working with medical and fitness teams. With discipline and care, diabetes is not a barrier to athletic excellence."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does health insurance cover diabetes patients?",
      "Yes, Vietnam’s health insurance (BHYT) covers diabetes treatment, including: Basic medications (e.g., insulin, metformin), HbA1c testing every 3 months, Partial coverage (up to 30%) based on age, BMI, and complications. However, routine screenings and some private treatments may not be fully covered."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Why should you limit grilled foods when you have diabetes?",
      "Grilled foods, especially when charred or overcooked, may produce harmful compounds like AGEs (advanced glycation end-products), which: Increase inflammation, Worsen insulin resistance, Raise the risk of heart and kidney complications. Limit charred meats and choose healthier cooking methods like steaming, baking, or boiling."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can nurses instruct on how to inject insulin properly?",
      "Yes, trained nurses can teach patients how to inject insulin correctly, including: Injection sites and rotation, Dosage preparation, Safe handling and storage. They play a key role in diabetes self-care education."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How does diabetes affect the kidneys?",
      "Diabetes can damage the kidney’s tiny blood vessels, leading to diabetic nephropathy. Over time, this causes protein leakage in urine, high blood pressure, and eventually kidney failure if uncontrolled. Regular urine and blood tests help monitor kidney health."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is hyperglycemic coma?",
      "A hyperglycemic coma is a life-threatening condition caused by very high blood sugar (often >600 mg/dL or 33 mmol/L). It can occur in: Type 2 diabetes (called Hyperosmolar Hyperglycemic State – HHS). Type 1 diabetes (as Diabetic Ketoacidosis – DKA). Symptoms include extreme thirst, confusion, weakness, dry skin, rapid heartbeat, and unconsciousness. It requires emergency treatment with fluids, insulin, and electrolyte correction."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does diabetes cause numbness in my hands and feet?",
      "Yes. Diabetes can cause peripheral neuropathy, leading to numbness, tingling, or burning in the hands and feet. It results from nerve damage due to prolonged high blood sugar levels. Early control helps prevent progression."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What support do people with diabetes need in remote areas?",
      "People with diabetes in remote areas need: Access to medication and insulin, Glucose monitoring tools (glucometers, strips), Trained healthcare workers for diabetes care, Telemedicine or mobile clinics for regular check-ups, Education on diet, symptoms, and self-care, Transportation support for reaching clinics, Community programs for awareness and emotional support. These ensure safe, continuous, and effective diabetes management."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How should people with diabetes deal with social stigma (if any)?",
      "To deal with social stigma, people with diabetes should: Stay informed: Understand their condition to confidently address misconceptions. Educate others: Gently correct false beliefs when possible. Seek support: Join diabetes groups or talk with peers facing similar issues. Communicate openly: Let trusted friends or coworkers know their needs. Focus on self-care: Prioritize health over judgment or stigma. Stigma comes from misunderstanding—knowledge and confidence are key to overcoming it."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is diabetes related to Alzheimer's?",
      "Yes, diabetes—especially type 2—is linked to a higher risk of Alzheimer’s disease. High blood sugar and insulin resistance can: Damage brain blood vessels, Increase inflammation and oxidative stress, Impair memory and thinking. Some experts even call Alzheimer's \"type 3 diabetes\" due to this strong connection. Managing diabetes may help reduce the risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can they drink beer and wine when they have diabetes?",
      "Yes, in moderation, and only if blood sugar is well-controlled: Beer and sweet wines contain carbs and can raise blood sugar. Alcohol may also cause low blood sugar, especially with insulin or certain meds. Limit to 1 drink/day (women), 2 drinks/day (men). Always eat when drinking and monitor glucose closely. Consult your doctor first."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should I tell my friends that I have diabetes?",
      "Yes, it’s wise to tell trusted friends. They can: Support you in managing your condition, Recognize signs of low or high blood sugar, Help in emergencies (e.g., hypoglycemia). Sharing helps reduce stress and improves safety."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "When should I measure my blood sugar during the day?",
      "Measure at key times: Fasting (before breakfast), Before meals, 2 hours after meals, At bedtime, When feeling symptoms (dizzy, weak, etc.) Frequency depends on your treatment plan—ask your doctor for a schedule."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can patients stop taking medication if they are well controlled?",
      "Sometimes, yes—especially in type 2 diabetes. If blood sugar is well controlled through:Healthy diet, Regular exercise, Weight loss. Your doctor may reduce or stop medication. However, never stop on your own. Always follow medical advice and continue regular monitoring."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does blood sugar change in the cold season?",
      "Yes, blood sugar can change in the cold season: It may rise due to less physical activity, holiday eating, or the body’s stress response to cold. Illnesses like colds or flu can also raise blood sugar. In some, increased insulin resistance occurs in winter. Stay active, eat well, monitor regularly, and dress warmly to stay in control."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should diabetics eat fruit?",
      "Yes, but choose low-GI, high-fiber fruits like berries, apples, pears, or oranges. Eat in moderation, avoid dried fruits and fruit juices, and pair with protein or healthy fat to slow sugar absorption."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of stem cell research in treating diabetes?",
      "Stem cell research aims to treat or cure diabetes by: Regenerating insulin-producing beta cells in the pancreas, Offering a potential long-term solution for type 1 diabetes, Reducing or replacing the need for insulin injections, Supporting studies on immune tolerance to prevent beta cell destruction. Though promising, it's still mostly in research or clinical trial stages."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How does insulin work in the body?",
      "Insulin is a hormone made by the pancreas that helps: Move glucose from the blood into cells, where it's used for energy. Store excess glucose in the liver and muscles for later use. Keep blood sugar levels stable, especially after eating. Without enough insulin (or if it doesn't work well), blood sugar stays high, leading to diabetes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Does meditation improve blood sugar control?",
      "Yes, meditation can help improve blood sugar control by: Reducing stress, which lowers cortisol and stabilizes glucose. Improving sleep and emotional well-being. Supporting healthier lifestyle choices. It's a helpful tool alongside medication, diet, and exercise."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of Telehealth in monitoring chronic patients?",
      "Telehealth helps monitor chronic patients by: Allowing remote check-ups and consultations, Enabling real-time data sharing (e.g., glucose levels), Improving treatment adherence and follow-up, Reducing the need for frequent hospital visits. It enhances access, especially for those in remote areas."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can diabetes be prevented?",
      "Type 1 cannot be prevented. Type 2 can often be prevented by: Maintaining healthy weight, Eating a balanced diet, Regular physical activity. Controlling blood pressure and cholesterol. Avoiding smoking and limiting alcohol"
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can teachers help students with diabetes?",
      "Teachers can help students with diabetes by: Knowing symptoms of low/high blood sugar. Allowing snacks, water, or glucose checks during class. Letting them leave for medical care when needed. Communicating with parents and school nurse. Being supportive and avoiding stigma. Helping maintain a regular schedule for meals and activities. Supportive teachers help students stay safe and confident at school."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What policies support diabetes patients in remote areas?",
      "Vietnam supports diabetes patients in remote areas through: Telehealth programs for remote consultations, Upgraded local clinics via the satellite hospital project, Free insulin and glucose meters for children (via partnerships). These policies improve access to care and treatment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What do medical students need to learn to care for diabetic patients?",
      "Medical students need to learn: Diabetes types, causes, and symptoms. Blood glucose monitoring and interpreting results. Medication use (oral drugs, insulin). Nutrition and lifestyle counseling. Complication screening (eyes, kidneys, feet). Patient education and communication. These skills ensure comprehensive, patient-centered care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is it better to eat unsweetened pho than bread?",
      "Yes, for people with diabetes, unsweetened pho is generally better than bread, if: It's made with clear broth, lean meat, and minimal noodles. You skip sugary sauces and limit portion size. Pho has more protein and fluid, which slows glucose absorption. White bread spikes blood sugar faster due to its high glycemic index. Always watch total carbs and balance your meal."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do people with diabetes often feel self-conscious?",
      "Yes, many people with diabetes feel self-conscious about monitoring blood sugar, injecting insulin, dietary restrictions, or stigma. This can affect social interactions, confidence, and mental health. Support from family, peers, and professionals helps reduce this burden."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How should I deal with hypoglycemia in the middle of the night?",
      "If you experience hypoglycemia at night: Wake up and check your blood sugar immediately. If it's <70 mg/dL (3.9 mmol/L), eat 15g of fast-acting carbs (e.g., ½ cup juice, glucose tablets, or 1 tablespoon honey). Recheck in 15 minutes. If still low, repeat the 15g carbs. Once normal, eat a small snack with protein (e.g., a few crackers with cheese) to prevent another drop. Inform your doctor if it happens often—your treatment may need adjustment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can children get diabetes?",
      "Yes. Type 1 is common in children and teens. Type 2 is increasing in children due to obesity and inactivity. Early symptoms should not be ignored."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is diabetes?",
      "Diabetes is a chronic metabolic disorder where the body either doesn’t produce enough insulin or cannot effectively use the insulin it produces, leading to elevated blood glucose levels."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should people with diabetes try intermittent fasting?",
      "Intermittent fasting may help some people with Type 2 diabetes by improving insulin sensitivity and aiding weight loss. However: It must be done under medical supervision. Risk of hypoglycemia increases if on insulin or certain medications. Not recommended for Type 1 diabetes, pregnant women, or those with eating disorders. Always consult your doctor before starting intermittent fasting."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What are the early signs of diabetes?",
      "Early signs include frequent urination, excessive thirst, unexplained weight loss, increased hunger, fatigue, blurred vision, slow-healing wounds, and frequent infections."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How many hours should a diabetic sleep each day?",
      "People with diabetes should sleep 7–8 hours per night. This helps improve blood sugar control, reduce insulin resistance, and support overall health. Poor sleep may worsen glucose levels and increase complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Should I eat late at night if I feel hungry?",
      "If you have diabetes and feel hungry late at night, it’s okay to eat — but choose wisely: Opt for a light, balanced snack: a boiled egg, a few nuts, plain yogurt, or whole-grain crackers with cheese. Avoid sugary or high-carb foods that spike blood sugar. If hunger happens often, discuss it with your doctor — it could indicate medication or meal timing needs adjustment. Night snacks should be small, steady, and blood sugar-friendly."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is a high blood sugar level?",
      "A high blood sugar level (hyperglycemia) is: Fasting: ≥ 126 mg/dL, Post-meal (2 hours after eating): ≥ 200 mg/dL, Random: ≥ 200 mg/dL with symptoms. Persistent high levels indicate diabetes or poor glucose control."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How to control stress when living with diabetes?",
      "To manage stress with diabetes: Exercise regularly (walk, yoga, etc.), Practice relaxation (deep breathing, meditation), Maintain routine for meals and sleep, Talk to others (support groups, therapists), Monitor blood sugar—stress can raise it, Avoid alcohol and caffeine overuse. Stable emotions help stabilize glucose."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the effect of GLP-1 in treating diabetes?",
      "GLP-1 (glucagon-like peptide-1) drugs help treat diabetes by: Increasing insulin release when blood sugar is high, Reducing glucagon (a hormone that raises blood sugar), Slowing stomach emptying, which controls appetite and blood sugar, Aiding weight loss, which improves glucose control. Examples: semaglutide, liraglutide, exenatide. They’re often used for type 2 diabetes and may reduce heart risk."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What should people with diabetes do if they eat cake at a wedding?",
      "If a person with diabetes eats cake at a wedding, they should: Limit the portion (a small slice), Eat slowly and with a balanced meal if possible, Monitor blood sugar before and 1–2 hours after, Adjust medication or activity if advised by a doctor. Avoid seconds and high-sugar drinks. Enjoy the moment—moderation and planning help keep blood sugar stable."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with diabetes do high-stress jobs?",
      "Yes, people with diabetes can do high-stress jobs, but they need to: Monitor blood sugar regularly, Manage stress through breaks, exercise, or relaxation techniques, Eat on schedule and stay hydrated, Keep medication and snacks nearby. With good self-care and planning, high-stress roles are manageable."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the role of Big Data in treating chronic diseases?",
      "Big Data plays a key role in treating chronic diseases by: Collecting and analyzing vast health data from patients, Identifying patterns and risk factors for early diagnosis, Personalizing treatment plans based on patient history and genetics, Monitoring treatment effectiveness and predicting complications, Supporting healthcare providers with real-time decision-making. It improves outcomes and efficiency in managing diseases like diabetes."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How can AI help diagnose diabetes?",
      "AI helps diagnose diabetes by: Analyzing large medical data (blood tests, symptoms, genetics) quickly, Identifying patterns and risk factors earlier than humans, Supporting doctors with predictive models to detect prediabetes or complications, Improving personalized treatment plans. AI enhances accuracy, speed, and prevention efforts in diabetes care."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Are there any comorbidities that often accompany diabetes?",
      "Yes, common comorbidities with diabetes include: Hypertension, Dyslipidemia (high cholesterol), Cardiovascular disease, Kidney disease, Obesity, Depression. Managing these is crucial to prevent complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Has anyone ever cured diabetes using folk methods?",
      "No, there is no scientific evidence that folk methods can cure diabetes. Type 1: Cannot be cured—requires lifelong insulin. Type 2: May be improved or go into remission with lifestyle changes, not folk remedies alone. Some herbal or traditional remedies may help support blood sugar control, but they must not replace medical treatment. Always consult a doctor before using any non-prescribed method."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "What is the impact of urbanization on diabetes rates?",
      "Urbanization increases diabetes rates due to: Sedentary lifestyles. High-calorie, processed diets. Increased stress. Reduced physical activity. These factors raise obesity and type 2 diabetes risk in urban populations."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Do I need to monitor my blood pressure when I have diabetes?",
      "Yes. Diabetes increases the risk of high blood pressure, which accelerates damage to the heart, kidneys, eyes, and blood vessels. Target: usually <130/80 mmHg. Regular monitoring helps prevent complications."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Is the HOMA-IR index related to insulin resistance?",
      "Yes, the HOMA-IR index (Homeostatic Model Assessment of Insulin Resistance) is used to estimate insulin resistance. It is calculated from fasting glucose and fasting insulin levels. A higher HOMA-IR value indicates greater insulin resistance, which is common in type 2 diabetes and obesity. Doctors use it to assess risk and guide treatment."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "How to eat healthy when working in an office?",
      "To eat healthy while working in an office: Pack balanced meals: Include lean protein, whole grains, and vegetables. Prepare healthy snacks: Nuts, yogurt, boiled eggs, or fruit. Avoid sugary drinks and snacks: Choose water or unsweetened tea. Eat on schedule: Don’t skip meals to prevent blood sugar drops. Control portions: Use small containers to avoid overeating. Plan ahead to stay energized and maintain stable blood sugar."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can people with severe diabetes live independently?",
      "Yes, people with severe diabetes can live independently if they: Monitor blood sugar regularly, Follow their treatment plan (medication/insulin), Maintain a healthy diet and lifestyle, Recognize and manage symptoms of highs/lows, Have access to medical care and support. In advanced cases with complications, some may need help—but with proper management, many remain fully independent."
    ],
    [
      "Hi!",
      "Hello, how can I help?",
      "Can thin people also have diabetes?",
      "Yes. Thin people can have diabetes: Type 1: Often occurs in lean individuals due to autoimmune destruction of insulin cells. Type 2: Can occur due to genetics, poor diet, or insulin resistance despite normal weight. LADA (latent autoimmune diabetes in adults): A slow-onset Type 1 often misdiagnosed as Type 2 in thin adults. Weight isn’t the only risk factor."
    ]
  ]
}